//
// Created by admin on 06.10.2026.
//

#include "hardware.h"

// что-то вроде регистра конфигурации портов ввода-вывода
// каждые два бита отвечают за режим работы одного физического пина (ножки чипа).
//  • Бит 0 и Бит 1 — настраивают Пин 0.
//  • Бит 2 и Бит 3 — настраивают Пин 1.
//  • Бит 4 и Бит 5 — настраивают Пин 2, и так далее. (режим Out = 0b01)
//
// ТЗ: нужно - переключить пин_2 в Out
// 1. Гарантированно очищает (сбрасывает в 0) 4-й и 5-й биты, не изменяя при этом все остальные биты регистра.
// 2. Устанавливает 4-й бит в 1 (5-й бит при этом должен остаться нулевым после первого шага).
void set_gpio_to_out(volatile uint32_t *GPIO_MODER, int pin)
{
    *GPIO_MODER &= ~(3UL << (pin*2));
    *GPIO_MODER |= (1UL << (pin*2));
}

// Задача 2 (Упаковка флагов беспилотника)
//   Бит:     7      6      5      4      3      2      1      0
//        +------+------+------+------+------+------+------+------+
//        |         motor_speed       |  0   | bat  |  error_code |
//        +------+------+------+------+------+------+------+------+
// Маски:   (только 4 младших бита)          (1 бит)    (2 бита)

// пишем прошивку для беспилотника на STM32. Нужно раз в секунду отправлять по радиоканалу пакет статуса.
// Чтобы сэкономить заряд батареи и трафик, нужно упаковать три разных параметра в один единственный байт:
// 1) error_code (Код ошибки): может принимать значения от 0 до 3
// 2) battery_low (Флаг разряда батареи): обычный bool
// 3) motor_speed (Уровень скорости мотора): может принимать значения от 0 до 15
// бит_3 не используется
//
//    uint8_t error = 3;
//    bool bat = false;
//    uint8_t speed = 9;
//    uint8_t packet = pack_status(error, bat, speed);
//    printf("packet : %d\n", packet);
//    uint8_t speed2 = unpack_speed(packet);
//    printf("speed: %d\n", speed2);
uint8_t pack_status(uint8_t error, bool bat, uint8_t speed)
{
    uint8_t res = 0;

    // form motor_speed
    res |= ((speed & 0xF) << 4);

    // form bat
    res |= (((unsigned char)bat & 0x1) << 2);

    // form error_code
    res |= ((error & 0x3));

    return res;
}

// обратная задача (к функции выше) - достаем Скорость из Пакета
uint8_t unpack_speed(uint8_t status_byte)
{
    return ((status_byte >> 4) & 0xF);
}


